#Переменные

stroka1 = 'Я простая строка'
stroka2 = '123'
celoe_4islo = 352
drobnoe_4islo = 12.5


#Cтандартные функциии
#преобразование строки в число(!если в строке содержатся ТОЛЬКО числа)
print("int(\"1234\") вернет:", int("1234"))
#Приведение вещественного числа к целому
print("int(5551.5) вернет: ", int(5551.5))


#Базовые математические операции

# ** -возведение в степень
print("2**3 =", 2**3)
# // - целочисленное деление
print("5//2 = ", 5//2)





#Печать на экране
print("Печать имени переменной: " + "stroka1")
    # или
print("Печать имени переменной: ", "stroka2")

print("Печать значние перемннной: " + stroka1)
print("Печать значения переменной:", drobnoe_4islo)

#Считывание текста
input()
vash_text = input("Введите Ваш текст, Python запомнит его в переменной vash_text")

#
